Процедура ПриСозданииНаСервере(Форма) Экспорт
	Если Форма.ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента" 
		ИЛИ  Форма.ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" 
		ИЛИ Форма.ИмяФормы = "Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьКонтактноеЛицоНаФорму(Форма); 
		
	ИначеЕсли Форма.ИмяФормы = "Документ.ОплатаОтПокупателя.Форма.ФормаДокумента" ИЛИ
		Форма.ИмяФормы = "Документ.ОплатаПоставщику.Форма.ФормаДокумента" Тогда
		ДобавитьКонтактноеЛицоНаФормуОплаты(Форма) 
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьКонтактноеЛицоНаФорму(Форма)
	
	Элементы = Форма.Элементы;
	
	ПолеКонтактноеЛицо = Элементы.Вставить("УР_КонтактноеЛицо", Тип("ПолеФормы"), Элементы.ГруппаШапкаПраво);
	ПолеКонтактноеЛицо.ПутьКДанным =  "Объект.УР_КонтактноеЛицо";
	ПолеКонтактноеЛицо.Вид = ВидПоляФормы.ПолеВвода;
КонецПроцедуры

Процедура ДобавитьКонтактноеЛицоНаФормуОплаты(Форма)
	
	Элементы = Форма.Элементы;
	
	ПолеКонтактноеЛицо = Элементы.Вставить("УР_КонтактноеЛицо", Тип("ПолеФормы"), ,Элементы.СуммаДокумента);
	ПолеКонтактноеЛицо.ПутьКДанным =  "Объект.УР_КонтактноеЛицо";
	ПолеКонтактноеЛицо.Вид = ВидПоляФормы.ПолеВвода;
КонецПроцедуры   

 
